"""
1. Вы продолжаете эксперименты со сном.
Теперь вам нужно просыпаться ровно в 6:30. Не очень хорошо..
И Вы продолжаете ложиться в разное время. Ужасно..
Но теперь вы хотите узнать, сколько времени у вас осталось до подъёма.

Задание:
Рассчитайте сколько времени у Вас есть на сон.
Создайте переменную bed_time_hours и сохраните туда часы в которые вы пошли спать.
Создайте переменную bed_time_minutes и сохраните туда минуты, когда вы пошли спать.
Выведите время которое Вам удастся хорошенько проспать.

Примечание:
Не забывайте что в сутках 24 часа, а в часах по 60 минут.

Например:
"Оставшееся время на сон 8 часов 35 минут"
"""


"""
2. Вам необходимо провести проверку участников соревнований по бегу.
Всего в соревновании учавствует runner_amount участников. 
У каждого из них необходимо узнать имя, возраст и выбранную дистанцию.

Это не самые толерантные соревнования поэтому бегунам 
с именем длиннее 5 букв или начинающимся на буквы "Ф" или "Г" 
запрещено участвовать.

Так же бегунам младше 18 лет запрещено бежать дистанцию больше 3 километров.

Задание:
Опросите всех участников соревнований.
Каждому из них выдайте разрешение выйти на дистанцию, 
либо выдайте запрет на участие.
"""