"""
1. Вы чрезвычайно любопытная мартышка, которая умеет в математику и ооочень любит бананы.
Как же вы любите считать! Ммм.. Дай вам волю, вы бы всё и всех пересчитали!
"Думал ко мне лезть?! А ну иди сюда! Посчитаю тебя и всю твою семью!", - кажется 
что-то подобное вы говорили однажды семейству жирафов.

Вы нашли достойную жертву: склад бананов. Ваша битва будет легендарной!
На складе три хранилища.
Первое заполнено на 3/4.
Второе на 2/5.
Третье на 1/10.

В полностью заполненном хранилище умещается 200 ящиков бананов.
В каждом ящике по 50 бананов.

Задание:
сколько бананов на складе останется после вашего подсчёта, 
если во время счёта, с каждого ящика вы хищно и с аппетитом пожрали по 2 банана.
"""