"""
1. Вы не прочь хорошо поспать. Но пора начать соблюдать хоть какой-то режим.
Вы решили, что теперь будете спать ровно по восемь часов. Неплохо..
Но продолжаете ложиться в разное время. Не очень хорошо..

Задание:
Рассчитайте время подъёма, если на сон у вас ушло ровно 8 часов.
Создайте переменную bed_time_hours и сохраните туда часы в которые вы пошли спать.
Создайте переменную bed_time_minutes и сохраните туда минуты, когда вы пошли спать.
Выведите время подъёма.

Примечание:
Не забывайте что в сутках 24 часа.

Например:
"Время подъёма 8:45! Вы ранняя пташка! Кря!"
"""

# Подсказка:
# get_up_hours = (get_up_hours + 8) % 24

"""
2. Утки. Утки захватили озеро в парке и решили, что кажды посетитель теперь 
должен платить им хлебом за посещение водоёма. 
Ещё утки любят всё делить поровну между собой.
Если хлеб невозможно поделить нацело на всех поровну, лишний хлеб 
убирается на утиный склад до лучших времён.

Задание:
Рассчитатйте сколько целых булок получит каждая утка.
Взрослый билет - две булки. 
Детский - одна булка. 

Создайте переменную duck_amount - храните в ней количество уток.
Создайте переменную adult_amount - храните в ней количество взрослых посетителей.
В переменной children_amount - сохраните количество маленьких посетителей.
В резульате выведите сообщение о том сколько булок достанется каждой утке и 
сколько булок оказалось на складе.
"""
