"""
СОРТИРОВКА ЗАГРУЗОК

работа с файлами в директории

Возможно Вам знакома проблема, когда в папке с загрузками много всякого разного и очень сложно найти то,
что действительно нужно.
Мы попробуем решить эту проблему. Создадим сортировщик, который раскидает все наши файлы по разным папкам
в зависимости от расширения файлов.
"""
# Примерный ход работы программы
# получение пути к сортируемой директории
# создаём правила для сортировки
# создаём папки под каждый тип файлов
# пробегаемся по содержимому загрузок
# отбираем только файлы, перекидываем их в соответствующие папки
