"""
ЛОВЕЦ ПИКАЧУХ

работа с файлами

Ещё не забыли как это здорово ловить беспомощных зверьков и засовывать их в маленькие шарики?
Внезапно мы получили запрос от службы по надзору за содержанием покемонов.
Оказалось, что теперь нельзя всех покемонов пихать в маленькие шарики. Ну вот :с
Для каждого покемона должен быть шарик, который будет соответсвовать его размеру и типу.

Список покемонов и их свойств хранится в файле pokemon_list.txt
Список соответствующих правил распределения по типу в файле new_type_rules.txt

Создайте новый файл, где рядом с каждым покемоном будет подходящий ему шарик.
У покемона может быть несколько типов. В этом случае укажите все подходящие цвета шарика.

Пример:
Jigglypuff
#039
Type Normal Fairy

normal dirty-pink
fairy dark-pink

result
#039 Jigglypuff dirty-pink dark-pink
"""